{
   "attribute_tooltips" : [
      {
         "attribute" : "mind",
         "display_name" : "Mind",
         "description" : "The ability to think intelligently. A high Mind stat allows a hearthling to exceed in complex mental tasks. Influences Diligence, Curiosity, Inventiveness."
      },
      {
         "attribute" : "body",
         "display_name" : "Body",
         "description" : "Competence at physical activities. Hearthlings with a high Body stat will move faster. Influences Muscle, Speed, Stamina."
      },
      {
         "attribute" : "spirit",
         "display_name" : "Spirit",
         "description" : "Faith in other people. A high Spirit hearthling will easily befriend others and stand strong against enemies. Influences Courage, Willpower, Compassion."
      },
      {
         "attribute" : "diligence",
         "display_name" : "Diligence",
         "description" : "This hearthling's concentration. Diligent workers complete long tasks without getting distracted."
      },
      {
         "attribute" : "curiosity",
         "display_name" : "Curiosity",
         "description" : "How much this hearthling enjoys new experiences."
      },
      {
         "attribute" : "inventiveness",
         "display_name" : "Inventiveness",
         "description" : "How good this hearthling is at creating things. Good inventors are more likely to create fine craftables."
      },
      {
         "attribute" : "muscle",
         "display_name" : "Muscle",
         "description" : "This hearthling's brawn. Contributes to damage in combat."
      },
      {
         "attribute" : "speed",
         "display_name" : "Speed",
         "description" : "How fast this hearthling moves."
      },
      {
         "attribute" : "stamina",
         "display_name" : "Stamina",
         "description" : "How long this hearthling can work before needing rest."
      },
      {
         "attribute" : "courage",
         "display_name" : "Courage",
         "description" : "How brave this hearthling is in the face of combat. Less courageous hearthlings are liable to flee from enemies."
      },
      {
         "attribute" : "willpower",
         "display_name" : "Willpower",
         "description" : "How likely this hearthling is to resist enemy charms."
      },
      {
         "attribute" : "compassion",
         "display_name" : "Compassion",
         "description" : "How likely this hearthling will help out a fellow villager or befriend others."
      }
   ],
   "score_tooltips": [
      {
         "score" : "net_worth",
         "display_name" : "Net Worth",
         "town_description" : "The gold value of everything in the town's inventory.",
         "description" : "The gold value of everything in the town's inventory."
      },
      {
         "score" : "happiness",
         "display_name" : "Overall Moral",
         "town_description" : "How happy your citizens are overall. Aim for a value of 10 for ultimate happiness!",
         "description" : "This hearthling's overall happiness based on food, shelter, and safety."
      },
      {
         "score" : "food",
         "display_name" : "Food",
         "town_description" : "How your citizens feel about the town's food situation. Is there enough to eat? Try to obtain a variety of foods!",
         "description" : "Make sure foods of different variety and quality are available. Cooked foods are more liked than raw foods."
      },
      {
         "score" : "shelter",
         "display_name" : "Shelter",
         "town_description" : "How your citizens feel about their lodging situation. Are there beds to sleep in?",
         "description" : "Make sure your hearthlings have a comfortable bed to sleep in."
      },
      {
         "score" : "safety",
         "display_name" : "Safety",
         "town_description" : "How your citizens feel about the town's security. Is the town well protected or getting pillaged by goblins?",
         "description" : "Protect your town from raiders and make your citizens feel safe by assigning guards."
      }
   ]
}