{
   "type" : "encounter",
   "encounter_type" : "collection_quest",
   "rarity" : "common",

   "in_edge"  : "fakeout_shakedown",

   "collection_quest_info" : {
      "out_edges" : {
         "refuse" : "",
         "fail" : "",
         "success" : ""
      },

      "script" : "file(fakeout_shakedown/fakeout_shakedown.lua)",

      "source_entity" : "ogo_camp.fakeout_shakedown_entity",

      "duration" : "4d",

      "nodes" : {
         "shakedown" : {
            "bulletin" : {
               "title" : "A goblin with a officious smirk slithers into town",
               "dialog_title" : "Ogo's Bannerman",
               "portrait" : "file(images/ogo_bannerman.png)",
               "message" : [
                  "By order of Ogo Skullbonker, Goblin-All-Chief-To-Be, you now give tribute!",
                  "Soothsayer say Ogo Skullbonker will be hero above all heroes! You destined to give him gold!",
                  "Soothsayer little, but have big thoughts! Soothsayer never wrong. Soothsayer say you give Ogo gold, or Ogo will take it from you!"
                  "I envoy of Ogo Skullbonker, tamer of Mountains! Ogo demand many thing from all, include you, include your gold!",
                  "Goblins long be shunned and forgotten. Ogo Skullbonker, my LittleChief, will soon change everything! For that, he need gold, your gold!",
                  "Ogo Skullbonker, now of Here, soon Chief-Of-Chiefs over all Red Kiln! You next of many conquests. You become our goldfarmer, we no kill you!",
                  "I am Bannergoblin of Ogo Skullbonker, rider of Mountains! My master demand you tribute, in form of gold shinies. You give! Or you pay!",
                  "Ogo Skullbonker, Master of Masters, have great destiny, to rule over all! Soothsayer say so; soothsayer never wrong. Soothsayer say, you will help!",
                  "Foolish human town! When you bested the small scout chieftains, you only bring Ogo's Eye upon you! And Ogo's Eye know all! You will give tribute, or eye will see your end!"
               ]
            }
         },
         "shakedown_refused" : {
            "bulletin" : {
               "title" : "The bannerman laughs",
               "dialog_title" : "Ogo's Bannerman",
               "portrait" : "file(images/ogo_bannerman.png)",
               "message" : [
                  "What? You say no? Your mistake. Ogo Soothsayer never wrong. You will soon die!",
                  "Cannot believe you human so dumb. Ogo Skullbonker no earn his name by smelling pretty flowers. He come! You die!",
                  "Hahaha! Human this stupid? Mountain will fall on you, smash you to jelly!",
                  "No? You really say no? Amazing! Soothsayer saw this too; soothsayer never wrong! Ogo be here in a bit, to smash you all to death!",
                  "Well, had to try. Will be back soon with giant army to take what you no give us!"
               ]               
            }
         },
         "collection_progress" : {
            "bulletin" : {
               "title" : "Mountains of Gold Shinies",
               "dialog_title" : "Ogo's Bannerman",
               "portrait" : "file(images/ogo_bannerman.png)",
               "message" : [
                  "Hahaha! Ogo soothsayer never wrong! He saw you weak, you cowardly! We strong!",
                  "Ahhh, good choice, puny human. We will be back soon! For everything!",
                  "Ah, good! We be back in four day. No worry, take time, hahahahah!",
                  "Good pick, good pick! We cannot wait to be bestest of friends. Good friendship always start with shinies."
                  "Hahah! Red Kiln should see Ogo now! We will defeat them! Mountain on our side! Fate on our side! For Ogo Skullbonker!"
               ]               
            }
         },
         "collection_due" : {
            "bulletin" : {
               "title" : "Collection Due",
               "dialog_title" : "Ogo's Bannerman",
               "portrait" : "file(images/ogo_bannerman.png)",
               "message" : [
                  "Collection due: Amazing we got here!"
               ]               
            }
         },
         "collection_failed" : {
            "bulletin" : {
               "title" : "Collection Failed",
               "dialog_title" : "Ogo's Bannerman",
               "portrait" : "file(images/ogo_bannerman.png)",
               "message" : [
                  "Collection failed: Amazing we got here!"
               ]               
            }
         },
         "collection_success" : {
            "bulletin" : {
               "title" : "Collection Success",
               "dialog_title" : "Ogo's Bannerman",
               "portrait" : "file(images/ogo_bannerman.png)",
               "message" : [
                  "Collection success: amazing we got here!"
               ]               
            }
         }
      }
   }
}
